{
  "beyond_smart_speakers_get_your_google_assistant_apps_ready_for_smart_displays": {
    "complexity": "Intermediate",
    "description": "In an ever-expanding world of devices for the Google Assistant (smart speaker, smartphone, tablet, smartwatch, earphones, smart TV, car, smart display, and the list goes on and on), developers face today completely new challenges in creating effective and consistent experiences for users. In this talk, we’ll take a closer look at our user’s daily journey as they’re moving from one device to another and cover some key considerations for designing Actions on Google across surfaces - with useful tips to understand when and how to leverage visuals alongside voice interactions, to create rich, delightful conversational experiences for smart displays and more.",
    "icon": "",
    "image": "",
    "language": "English",
    "languageFlag": "🇬🇧",
    "presentation": "",
    "speakers": [
      "aygul_zagidullina"
    ],
    "tags": [
      "Assistant"
    ],
    "title": "Beyond Smart Speakers: Get Your Google Assistant Apps Ready for Smart Displays",
    "videoId": ""
  },
  "library_development_open_source_your_ideas": {
    "complexity": "Beginner",
    "description": "Have you ever thought that your idea could help other developers? Join the magic world of open source! \r\nIn this talk we are going to share some tips and the secrets to become an open source master. Of course some practical examples based on our experience cannot miss.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "https://speakerdeck.com/prof18/library-development-open-source-your-ideas-devfest-milano-18",
    "speakers": [
      "marco_gomiero",
      "andrea_maglie"
    ],
    "tags": [
      "Open Source"
    ],
    "title": "Library development: open source your ideas!",
    "videoId": ""
  },
  "develop_a_product_on_gcp": {
    "complexity": "Intermediate",
    "description": "How to develop a scalable and multi tenant product on GCP from scratch using some of the services provided by Google. ",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "",
    "speakers": [
      "francesca_stagnaro"
    ],
    "tags": [
      "Web",
      "Design",
      "Google Cloud"
    ],
    "title": "Develop a product on GCP",
    "videoId": ""
  },
  "arcore_is_magic": {
    "complexity": "Beginner",
    "description": "ARCore is the Google library that allows to build new augmented reality experiences that seamlessly blend the digital and physical worlds. We will see all the features supported by ARCore through the development of a \"Magic\" App",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "https://speakerdeck.com/mikelantonio/arcore-is-magic",
    "speakers": [
      "michelantonio_trizio"
    ],
    "tags": [
      "Android",
      "ARCore"
    ],
    "title": "ARCore is Magic",
    "videoId": ""
  },
  "abracagan_introduction_to_the_almost_magical_world_of_gans": {
    "complexity": "Intermediate",
    "description": "Requires: entry-level Python and TensorFlow knowledge\r\n\r\nGenerative Adversarial Networks (GANs for brevity) are one of the hottest topics in the Deep Learning world.\r\n\r\nAfter briefly introducing the core theory behind this family of models, we will go over some significant milestones and real-world applications. Having a better understanding of what a GAN is and how it can solve real-world problems, the talk will cover how to code one using Python + TensorFlow and the few steps required to deliver it quickly to production using Google Cloud ML Engine.\r\n\r\nThe Talk will feature slides, materials under the form of Jupyter Notebooks on Colab will be made available before the session.",
    "icon": "",
    "image": "",
    "language": "English",
    "languageFlag": "🇬🇧",
    "presentation": "",
    "speakers": [
      "michele_de_simoni"
    ],
    "tags": [
      "Big Data",
      "Machine Learning"
    ],
    "title": "AbracaGAN: Introduction to the almost magical world of GANs",
    "videoId": ""
  },
  "guida_intergalattica_per_cercatori_di_lavoro": {
    "complexity": "Beginner",
    "description": "Come strutturare un buon CV tips & tricks. Come fare un buon colloquio, utilizzare i social al fine di trovare un impiego e gestire la propria reputation online.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "",
    "speakers": [
      "valentina_carrirolo",
      "clara_canova"
    ],
    "tags": [
      "Digital Wellbeing",
      "Social Media"
    ],
    "title": "Guida intergalattica per cercatori di lavoro",
    "videoId": ""
  },
  "behind_the_curtains_how_photos_works": {
    "complexity": "Intermediate",
    "description": "Google Photos is an amazing piece of software, and API are pretty amazing. The only problem? They are not available on Android just yet. Join us to learn how we bypassed this limitation to create a selfie box based on Kotlin, Things™, and, of course, Google Photos!",
    "icon": "",
    "image": "",
    "language": "English",
    "languageFlag": "🇬🇧",
    "presentation": "https://speakerdeck.com/tiwiz/behind-the-curtains-how-photos-work",
    "speakers": [
      "roberto_orgiu"
    ],
    "tags": [
      "Android",
      "Kotlin"
    ],
    "title": "Behind the curtains: how Photos™ works",
    "videoId": ""
  },
  "introducing_workmanager": {
    "complexity": "Intermediate",
    "description": "Background processing is an integral part of Android development, and the WorkManager API is the architecture component to manage your Android background jobs.\r\n\r\nNew battery optimizations are key to improving the user experience, but these bring new challenges for the developers implementing background jobs:\r\n* API Level 23 introduced Doze Mode and App Standby\r\n* API Level 24 limited implicit Broadcasts and introduced doze-on-the-go\r\n* API Level 26 further limited background behavior\r\n\r\nWorkManager supports a combination of opportunistic and guaranteed execution. \r\n\r\nIn this talk you’ll learn what WorkManager is and how you can use it to:\r\n* Schedule a simple task\r\n* Chain tasks\r\n* Display task status in the UI\r\n* Cancel tasks \r\n\r\nWorkManager API is part of Android Jetpack’s Architecture Component, and is currently in alpha.\r\n",
    "icon": "",
    "image": "",
    "language": "English",
    "languageFlag": "🇬🇧",
    "presentation": "",
    "speakers": [
      "pietro_maggi"
    ],
    "tags": [
      "Android",
      "Kotlin"
    ],
    "title": "Introducing WorkManager",
    "videoId": ""
  },
  "digital_records_evidence_-_oracles_and_the_bitcoin_blockchain": {
    "complexity": "Intermediate",
    "description": "Blockchain is like sex and teenagers: everyone talks about it but no one address it correctly.\r\nOne of the main issues is the trust and authenticity of the digital records that we write and read from the DLT.\r\nOracles are definitely one the solutions in the scene, let's see how they works and what they guarantee.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "https://docs.google.com/presentation/d/1FRi6jyuBpqkLt2snFiao1lMSTxAiRZ_5qMUJf3m8_jw/edit?usp=drivesdk",
    "speakers": [
      "alessandro_aglietti"
    ],
    "tags": [
      "Blockchain"
    ],
    "title": "Digital records evidence - Oracles and the Bitcoin blockchain",
    "videoId": ""
  },
  "designing_for_wicked_challenges": {
    "complexity": "Beginner",
    "description": "This workshop is based on the Lab Exercises I had the opportunity to facilitate with Dave Houge UX Lead, Android @Google and it is a really interesting workshop for developers/designers/product managers addressing challenges and interacting with users!\r\nThroughout 3 Lab exercises we will intro \"wicked problems\", what are they, how to address them and how to \"try\" to solve them without creating others! That's wicked!\r\nAt each Lab Exercise attendees will do some hands-on design/sketching, discussion and ideation. Each Lab Exercise builds upon the information and exercises that preceded it. The third and final lab exercise is more opened-ended (and more wicked), because the attendees will have already been walked through the other exercises.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "",
    "speakers": [
      "panayotis_tzinis"
    ],
    "tags": [
      "Design"
    ],
    "title": "Designing for wicked challenges",
    "videoId": ""
  },
  "come_gestire_una_campagna_pubblicitaria_con_adwords_-_guida_di_sopravvivenza": {
    "complexity": "Beginner",
    "description": "In questo talk della durata di circa 30 minuti illustrerò il funzionamento base della piattaforma AdWords.\r\nAffronteremo varie cose tra cui: \r\n- creazione della campagna;\r\n- varie definizioni (CPC, CPA,...);\r\n- le reti di diffusione dell'annuncio;\r\n- ... e altri argomenti.\r\n\r\nIl talk è di livello beginner.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "",
    "speakers": [
      "mattia_piccirillo"
    ],
    "tags": [
      "Social Media",
      "Web"
    ],
    "title": "Come gestire una campagna pubblicitaria con AdWords - guida di sopravvivenza",
    "videoId": ""
  },
  "next_generation_web_assets": {
    "complexity": "Beginner",
    "description": "How the next generation web assets (AMP, PWA, Speed, UX) can have an impact on your mobile website KPI and on your revenue",
    "icon": "",
    "image": "",
    "language": "English",
    "languageFlag": "🇬🇧",
    "presentation": "",
    "speakers": [
      "emiliano_de_matteis"
    ],
    "tags": [
      "Design",
      "Web",
      "Marketing"
    ],
    "title": "Next generation web assets",
    "videoId": ""
  },
  "creating_ml-powered_applications": {
    "complexity": "Intermediate",
    "description": "Each day we are hearing yet another application that announces a new cool feature powered by machine learning. It’s pretty exciting but when the time comes to deep diving into machine learning, it can be intimidating, especially if you don’t have machine learning background.  \r\n\r\nIn this session, you will get the gist of newly announced MLKit & Tensorflow Lite. We'll be learning about MLKit features and creating custom Tensorflow model and using it in app via MLKit   ",
    "icon": "",
    "image": "",
    "language": "English",
    "languageFlag": "🇬🇧",
    "presentation": "",
    "speakers": [
      "busra_deniz_akn"
    ],
    "tags": [
      "Android",
      "Firebase",
      "Machine Learning"
    ],
    "title": "Creating ML-powered applications",
    "videoId": ""
  },
  "il_lato_oscuro_del_deep_learning": {
    "complexity": "Beginner",
    "description": "Tutti hanno sentito parlare almeno una volta del potere magico del machine learning. Quanti conoscono però il “lato oscuro” delle tecnologie data-driven, come bias negli algoritmi, violazione della privacy, e minacce alla sicurezza? Attenzione ad affidarsi ciecamente al “deep learning”, a meno di non essere in cerca di “deep trouble”.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "http://ispac.diet.uniroma1.it/scardapane/reveal/scardapane_converge.html#/",
    "speakers": [
      "simone_scardapane"
    ],
    "tags": [
      "Big Data",
      "Machine Learning"
    ],
    "title": "Il lato oscuro del Deep Learning",
    "videoId": ""
  },
  "introduction_to_sceneform": {
    "complexity": "Beginner",
    "description": "This codelab will guide you step by step to create an \"AR Stickers\" type application using ARCore. This application shows a gallery of objects that can be placed, or anchored in the augmented world. Then take a photo of the AR scene and save it to Photos.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "",
    "speakers": [
      "michelantonio_trizio"
    ],
    "tags": [
      "ARCore",
      "Android"
    ],
    "title": "Introduction to SceneForm",
    "videoId": ""
  },
  "firebase_cloud_firestore_deep_dive": {
    "complexity": "Intermediate",
    "description": "Firebase offers two cloud-based, client-accessible database solutions that support realtime data syncing. In this workshop, we’ll focus on Could Firestore, Firebase's new database solution. Cloud Firestore is an efficient, low-latency database solution for mobile apps that is optimized for speed, security, and offline use. As part of this workshop, we’ll build an app using Cloud Firestore focusing on realtime updates, expressive querying, and offline support. The workshop participants will learn how to read and write data to Firestore from an Android app, listen to changes in Firestore data in realtime, use Firebase Authentication and security rules to secure Firestore data, and write complex Firestore queries.",
    "icon": "",
    "image": "",
    "language": "English",
    "languageFlag": "🇬🇧",
    "presentation": "",
    "speakers": [
      "kaan_mamikoglu"
    ],
    "tags": [
      "Firebase",
      "Google Cloud"
    ],
    "title": "Firebase Cloud Firestore: Deep Dive",
    "videoId": ""
  },
  "the_power_of_kotlin_annotations": {
    "complexity": "Intermediate",
    "description": "The main topics of this session are:\r\n- What an annotation is\r\n- How to apply it\r\n- How to create a custom annotation\r\n- How to create an annotation processor",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "https://speakerdeck.com/fondesa/the-power-of-kotlin-at-annotations",
    "speakers": [
      "giorgio_antonioli"
    ],
    "tags": [
      "Kotlin",
      "Android"
    ],
    "title": "The power of Kotlin @Annotations",
    "videoId": ""
  },
  "solid_principles_in_practice_the_clean_architecture": {
    "complexity": "Intermediate",
    "description": "La clean architecture è stata formalizzata in un post da Robert C. Martini nel 2012, è abbastanza nuova anche se si basa sui principi SOLID (presentati per la prima volta nei primi anni 2000).\r\nIl beneficio principale che si ottiene usando questa architettura è la testabilità del codice, infatti impone una separazione netta fra il codice core dell'applicazione e quello relativo ai fattori esterni (che di solito complicano il testing).\r\nIn questo talk vedremo un esempio pratico in Kotlin di come sfruttare i principi alla base della clean architecture. Una particolare attenzione sarà tenuta per la D di SOLID: la dependency inversion.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "https://www.slideshare.net/fabio_collini/solid-principles-in-practice-the-clean-architecture",
    "speakers": [
      "fabio_collini"
    ],
    "tags": [
      "Android",
      "Kotlin"
    ],
    "title": "SOLID principles in practice: the clean architecture",
    "videoId": ""
  },
  "ml_kit_for_mobile_developers": {
    "complexity": "Intermediate",
    "description": "ML Kit is a mobile SDK that brings Google's machine learning expertise to Android and iOS apps in a powerful yet easy-to-use package.  During this talk, we are going to learn how we can boost out firebase app with a live demo that uses image recognition.",
    "icon": "",
    "image": "",
    "language": "English",
    "languageFlag": "🇬🇧",
    "presentation": "",
    "speakers": [
      "laura_morinigo"
    ],
    "tags": [
      "Firebase",
      "Machine Learning"
    ],
    "title": "ML Kit for Mobile Developers",
    "videoId": ""
  },
  "image_recognition_with_tensorflow_using_deep_learning": {
    "complexity": "Intermediate",
    "description": "Nowadays, Deep Learning is widely used in every IT sector even though a lot people might not know this. The expression “Deep Learning” brings together a vast series of algorithms which are based on the concept of the neural networks. \r\nToday, image recognition provided by neural networks and trained via Deep Learning is, in certain circumstances, better than humans’ recognition. \r\nFor instance, voice and image recognition provided by Google, relies on Deep Learning. What we buy or watch on Amazon and/or Netflix is generated by artificial neural networks calibrated on the basis of our taste. So, how does this work?\r\nIn this speech we are going to understand the basic principle of Deep Learning and how it could be performed with Tensorflow during the image recognition process.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "",
    "speakers": [
      "elia_rigo"
    ],
    "tags": [
      "Machine Learning"
    ],
    "title": "Image Recognition with TensorFlow using Deep Learning",
    "videoId": ""
  },
  "the_build_time_of_my_life": {
    "complexity": "Intermediate",
    "description": "Building an Android app can be an extremely frustrating experience for developers. Despite caching and all the new features in the Android build system, sometimes even the smallest change can cause a new build to take minutes. In this talk we will explore ways to improve your build times in a modern project that uses Kotlin, annotation processing and multiple modules.",
    "icon": "",
    "image": "",
    "language": "English",
    "languageFlag": "🇬🇧",
    "presentation": "https://speakerdeck.com/quiro91/the-build-time-of-my-life",
    "speakers": [
      "lorenzo_quiroli"
    ],
    "tags": [
      "Android"
    ],
    "title": "The (build) time of my life",
    "videoId": ""
  },
  "want_a_slice": {
    "complexity": "Intermediate",
    "description": "With the announcement of Android Slices, you can now provide rich, dynamic and interactive content to your users even outside your app! Slices allow you to build content to be displayed in the Google Search app and later in other places like the Google Assistant. Slices can help users perform tasks faster by enabling engagement outside of the fullscreen app experience. In this session, we’ll explore how Slices can help you provide a better experience for your users and see how it’s implemented.",
    "icon": "",
    "image": "",
    "language": "English",
    "languageFlag": "🇬🇧",
    "presentation": "",
    "speakers": [
      "kaan_mamikoglu"
    ],
    "tags": [
      "Android",
      "Assistant",
      "Firebase",
      "Design"
    ],
    "title": "Want a Slice?",
    "videoId": ""
  },
  "la_morte_nera_e_se_fosse_prototipizzata_con_firebase_e_react": {
    "complexity": "Intermediate",
    "description": "Vedremo come sfruttare al meglio Firebase e React per prototipazione veloce di applicazioni complesse. Sfruttando le nuove feature di Firebase in un contesto a componenti impareremo come accelerare senza perder pezzi per strada.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "",
    "speakers": [
      "michel_murabito"
    ],
    "tags": [
      "Firebase",
      "Web"
    ],
    "title": "La Morte Nera, e se fosse prototipizzata con Firebase e React?",
    "videoId": ""
  },
  "how_to_become_an_android_dev_starting_from_ios_and_vice_versa": {
    "complexity": "Intermediate",
    "description": "Starting from my working experience I want to describe the similarities between Android and iOS platforms, demonstrating that these worlds are not so far!",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "https://www.slideshare.net/GiuseppeFilograno/how-to-become-an-android-dev-starting-from-ios-and-vice-versa?qid=ba77201b-9a95-400e-b778-7e1b5fd43efb&v=&b=&from_search=1",
    "speakers": [
      "giuseppe_filograno"
    ],
    "tags": [
      "Android",
      "Kotlin"
    ],
    "title": "How to become an Android dev starting from iOS (and vice versa)",
    "videoId": ""
  },
  "android_jetpack_easy_navigation_with_the_new_navigation_controller": {
    "complexity": "Intermediate",
    "description": "Nel corso degli anni implementare la navigazione in app è sempre stato un incubo per gli sviluppatori Android. La risposta di Google a questo problema è Android Jetpack: un set di librerie per semplificare e accelerare lo sviluppo, creando app con basi solide e di alta qualità. Fra queste librerie vi è la Navigation, una libreria che semplifica sensibilmente l’implementazione della navigazione in una app Android, mettendoci a disposizione tool grafici e API che ci permettono di semplificare il codice, rendendolo più pulito e leggibile. In questa sessione parleremo di come usare il Navigation Editor in Android Studio, tramite XML o tramite le API Kotlin (o Java) per definire il navigation graph, e come tutto questo semplifica la navigazione nella tua app, e come gestire i deep link tramite la Navigation.",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "https://speakerdeck.com/lpirro/android-jetpack-easy-navigation-with-the-new-navigation-controller",
    "speakers": [
      "leonardo_pirro"
    ],
    "tags": [
      "Android"
    ],
    "title": "Android JetPack: Easy navigation with the new Navigation Controller",
    "videoId": ""
  },
  "motion_layout_easy_animations_for_everyone": {
    "complexity": "Intermediate",
    "description": "Vi è mai capitato di esservi ritrovati a scrivere valanghe di righe di codice nelle vostre view per realizzare semplici animazioni?\r\nSe la risposta è sí, allora questo è il Talk che fa per voi! La versione 2.0 in arrivo per il ConstraintLayout introduce il potentissimo MotionLayout!\r\nScopriamo insieme le potenzialità del MotionLayout tramite esempi e rimaniamo insieme stupiti dalla sua semplicità!",
    "icon": "",
    "image": "",
    "language": "Italian",
    "languageFlag": "🇮🇹",
    "presentation": "",
    "speakers": [
      "boris_damato"
    ],
    "tags": [
      "Android",
      "Design"
    ],
    "title": "Motion Layout: easy animations for everyone!",
    "videoId": ""
  }
}
